docs/test/results/20260321/k6-knee/admin-vus150.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 45s max duration (incl. graceful stop):
              * default: 150 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 150/150 VUs, 664 complete and 0 interrupted iterations
default   [   6% ] 150 VUs  01.0s/15s

running (02.0s), 150/150 VUs, 1355 complete and 0 interrupted iterations
default   [  13% ] 150 VUs  02.0s/15s

running (03.0s), 150/150 VUs, 2409 complete and 0 interrupted iterations
default   [  20% ] 150 VUs  03.0s/15s

running (04.0s), 150/150 VUs, 3462 complete and 0 interrupted iterations
default   [  26% ] 150 VUs  04.0s/15s

running (05.0s), 150/150 VUs, 4630 complete and 0 interrupted iterations
default   [  33% ] 150 VUs  05.0s/15s

running (06.0s), 150/150 VUs, 5780 complete and 0 interrupted iterations
default   [  40% ] 150 VUs  06.0s/15s

running (07.0s), 150/150 VUs, 6750 complete and 0 interrupted iterations
default   [  46% ] 150 VUs  07.0s/15s

running (08.0s), 150/150 VUs, 7848 complete and 0 interrupted iterations
default   [  53% ] 150 VUs  08.0s/15s

running (09.0s), 150/150 VUs, 8910 complete and 0 interrupted iterations
default   [  60% ] 150 VUs  09.0s/15s

running (10.0s), 150/150 VUs, 9983 complete and 0 interrupted iterations
default   [  66% ] 150 VUs  10.0s/15s

running (11.0s), 150/150 VUs, 11149 complete and 0 interrupted iterations
default   [  73% ] 150 VUs  11.0s/15s

running (12.0s), 150/150 VUs, 12290 complete and 0 interrupted iterations
default   [  80% ] 150 VUs  12.0s/15s

running (13.0s), 150/150 VUs, 13283 complete and 0 interrupted iterations
default   [  86% ] 150 VUs  13.0s/15s

running (14.0s), 150/150 VUs, 14171 complete and 0 interrupted iterations
default   [  93% ] 150 VUs  14.0s/15s

running (15.0s), 150/150 VUs, 15155 complete and 0 interrupted iterations
default   [ 100% ] 150 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 15353   1016.952255/s
    checks_succeeded...: 100.00% 15353 out of 15353
    checks_failed......: 0.00%   0 out of 15353

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=146.37ms min=3.33ms med=134.5ms  max=729.56ms p(90)=241.35ms p(95)=287.03ms p(99)=388.6ms 
      { expected_response:true }...: avg=146.37ms min=3.33ms med=134.5ms  max=729.56ms p(90)=241.35ms p(95)=287.03ms p(99)=388.6ms 
    http_req_failed................: 0.00%  0 out of 15353
    http_reqs......................: 15353  1016.952255/s

    EXECUTION
    iteration_duration.............: avg=146.62ms min=3.39ms med=134.62ms max=729.63ms p(90)=241.58ms p(95)=288.43ms p(99)=391.87ms
    iterations.....................: 15353  1016.952255/s
    vus............................: 150    min=150        max=150
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 23 MB  1.5 MB/s
    data_sent......................: 7.6 MB 505 kB/s



running (15.1s), 000/150 VUs, 15353 complete and 0 interrupted iterations
default ✓ [ 100% ] 150 VUs  15s