docs/test/results/20260321/k6-knee/admin-vus225.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: service_fixed_vus.js
        output: -

     scenarios: (100.00%) 1 scenario, 225 max VUs, 45s max duration (incl. graceful stop):
              * default: 225 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 225/225 VUs, 578 complete and 0 interrupted iterations
default   [   6% ] 225 VUs  01.0s/15s

running (02.0s), 225/225 VUs, 1274 complete and 0 interrupted iterations
default   [  13% ] 225 VUs  02.0s/15s

running (03.0s), 225/225 VUs, 2144 complete and 0 interrupted iterations
default   [  20% ] 225 VUs  03.0s/15s

running (04.0s), 225/225 VUs, 3097 complete and 0 interrupted iterations
default   [  26% ] 225 VUs  04.0s/15s

running (05.0s), 225/225 VUs, 4094 complete and 0 interrupted iterations
default   [  33% ] 225 VUs  05.0s/15s

running (06.0s), 225/225 VUs, 5144 complete and 0 interrupted iterations
default   [  40% ] 225 VUs  06.0s/15s

running (07.7s), 225/225 VUs, 6114 complete and 0 interrupted iterations
default   [  46% ] 225 VUs  07.0s/15s

running (09.9s), 225/225 VUs, 7065 complete and 0 interrupted iterations
default   [  53% ] 225 VUs  08.0s/15s

running (10.9s), 225/225 VUs, 7945 complete and 0 interrupted iterations
default   [  60% ] 225 VUs  09.0s/15s

running (11.9s), 225/225 VUs, 8998 complete and 0 interrupted iterations
default   [  66% ] 225 VUs  10.0s/15s

running (12.9s), 225/225 VUs, 9999 complete and 0 interrupted iterations
default   [  73% ] 225 VUs  11.0s/15s

running (13.9s), 225/225 VUs, 10974 complete and 0 interrupted iterations
default   [  80% ] 225 VUs  12.0s/15s

running (14.9s), 225/225 VUs, 11912 complete and 0 interrupted iterations
default   [  86% ] 225 VUs  13.0s/15s

running (15.9s), 225/225 VUs, 12894 complete and 0 interrupted iterations
default   [  93% ] 225 VUs  14.0s/15s

running (16.9s), 225/225 VUs, 13860 complete and 0 interrupted iterations
default   [ 100% ] 225 VUs  15.0s/15s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 14131   824.368873/s
    checks_succeeded...: 100.00% 14131 out of 14131
    checks_failed......: 0.00%   0 out of 14131

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=267.73ms min=22.72ms med=227.08ms max=2.71s    p(90)=405.5ms  p(95)=540.88ms p(99)=1.37s   
      { expected_response:true }...: avg=267.73ms min=22.72ms med=227.08ms max=2.71s    p(90)=405.5ms  p(95)=540.88ms p(99)=1.37s   
    http_req_failed................: 0.00%  0 out of 14131
    http_reqs......................: 14131  824.368873/s

    EXECUTION
    iteration_duration.............: avg=240.46ms min=22.8ms  med=227.26ms max=938.37ms p(90)=390.27ms p(95)=429.73ms p(99)=601.05ms
    iterations.....................: 14131  824.368873/s
    vus............................: 225    min=225        max=225
    vus_max........................: 225    min=225        max=225

    NETWORK
    data_received..................: 21 MB  1.2 MB/s
    data_sent......................: 7.2 MB 419 kB/s



running (17.1s), 000/225 VUs, 14131 complete and 0 interrupted iterations
default ✓ [ 100% ] 225 VUs  15s